Catalogs/УпаковкиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УпаковкиНоменклатуры</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РаботаСУпаковкамиНоменклатуры/Ext/Module.bsl
//При создании на сервере готовит форму к использованию упаковок
//Параметры: Форма Тип("ФормаУправляемогоПриложения")
//
//Возвращаемое значение: нет
//
Процедура ПриСозданииНаСервере(Форма) Экспорт
		
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ИспользуютсяУпаковки") Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектФормы = Форма.Объект;
	
	Если ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		Форма.Элементы.ТоварыГруппаКоличество.Видимость 		= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыЦена.Видимость 					= Не Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыЦенаЗаУпаковку.Видимость			= Форма.ИспользуютсяУпаковки;
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		Форма.Элементы.ТоварыГруппаКоличествоЕдиница.Видимость 	= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыГруппаЦена.Видимость 				= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыГруппаЦенаЗаУпаковку.Видимость 	= Форма.ИспользуютсяУпаковки;
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		Форма.Элементы.ТоварыГруппаКоличество.Видимость 		= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыЦена.Видимость						= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыЦенаЗаУпаковку.Видимость           = Форма.ИспользуютсяУпаковки;
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		Форма.Элементы.ТоварыГруппаКоличество.Видимость 		= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыЦена.Видимость						= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыЦенаЗаУпаковку.Видимость			= Форма.ИспользуютсяУпаковки;
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		Форма.Элементы.ТоварыГруппаКоличествоЕдиница.Видимость 	= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыГруппаЦена.Видимость 				= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ТоварыГруппаЦенаЗаУпаковку.Видимость 	= Форма.ИспользуютсяУпаковки;
	ИначеЕсли ТипЗнч(ОбъектФормы.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
		Форма.Элементы.ГруппаТоварыКоличествоЕдиница.Видимость 	= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ГруппаТоварыЦена.Видимость 				= НЕ Форма.ИспользуютсяУпаковки;
		Форма.Элементы.ГруппаТоварыЦенаЗаУпаковку.Видимость     = Форма.ИспользуютсяУпаковки;
	КонецЕсли;
	
	Форма.Элементы.ТоварыГруппаКоличествоУпаковка.Видимость = Форма.ИспользуютсяУпаковки;
		
КонецПроцедуры 

//Рассчитывает количество упаковок и заполняет сооответствующие реквизиты табличной части
//Параметры: ФормаОбъект Тип("ОбъектФормы")
//
//Возвращаемое значение: нет
//
Процедура ЗаполнитьДанныеУпаковок(ФормаОбъект) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры") Тогда
		Для Каждого СтрокаТовары Из ФормаОбъект.Товары Цикл
			СтрокаТовары.КоэффициентУпаковки = 1;	
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	ТаблицаТоваров = ФормаОбъект.Товары.Выгрузить(,"НомерСтроки, Номенклатура, Упаковка, Количество, Цена");
	ДанныеУпаковки = ПолучитьДанныеУпаковок(ТаблицаТоваров);
	
	Для Каждого СтрокаТовары Из ФормаОбъект.Товары Цикл
		СтрокаУпаковки = ДанныеУпаковки.Найти(СтрокаТовары.НомерСтроки, "НомерСтроки");
		Если Не ЗначениеЗаполнено(СтрокаУпаковки) Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаУпаковки, "Упаковка, КоэффициентУпаковки, УпаковкаЕдиницаИзмерения, КоличествоУпаковок, ЦенаЗаУпаковку");
		
		Если ТипЗнч(ФормаОбъект.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			Если ФормаОбъект.ЕстьРасхождения Тогда
				СтрокаТовары.КоличествоУпаковокПоДокументу 	= ОКР(СтрокаТовары.КоличествоПоДокументу / СтрокаТовары.КоЭффициентУпаковки, 3);
				СтрокаТовары.КоличествоУпаковокОтклонение	= ОКР(СтрокаТовары.КоличествоОтклонение / СтрокаТовары.КоэффициентУпаковки, 3);
				СтрокаТовары.ЦенаЗаУпаковкуПоДокументу 		= ОКР(СтрокаТовары.ЦенаПоДокументу * СтрокаТовары.КоэффициентУпаковки, 2);
				СтрокаТовары.ЦенаЗаУпаковкуОтклонение		= ОКР(СтрокаТовары.ЦенаОтклонение * СтрокаТовары.КоэффициентУпаковки, 2);
			Иначе
				СтрокаТовары.КоличествоУпаковокПоДокументу 	= СтрокаТовары.КоличествоУпаковок;
				СтрокаТовары.ЦенаЗаУпаковкуПоДокументу 		= СтрокаТовары.ЦенаЗаУпаковку;
			КонецЕсли;
		ИначеЕсли ТипЗнч(ФормаОбъект.Ссылка) = Тип("ДокументСсылка.КорректировкаПоступления") Или 
			ТипЗнч(ФормаОбъект.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
			СтрокаТовары.КоличествоУпаковокДоИзменения 		= ОКР(СтрокаТовары.КоличествоДоИзменения / СтрокаУпаковки.КоэффициентУпаковки, 3);
			СтрокаТовары.КоличествоУпаковокДоКорректировки 	= ОКР(СтрокаТовары.КоличествоДоКорректировки / СтрокаУпаковки.КоэффициентУпаковки, 3);
			СтрокаТовары.ЦенаЗаУпаковкуДоИзменения 			= ОКР(СтрокаТовары.ЦенаДоИзменения * СтрокаУпаковки.КоэффициентУпаковки, 2);
			СтрокаТовары.ЦенаЗаУпаковкуДоКорректировки      = ОКР(СтрокаТовары.ЦенаДоКорректировки * СтрокаУпаковки.КоэффициентУпаковки, 2);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

//Пресчитывает количество упаковок и цену за упаковку в строке табличной части
//При вставке строки из подбора
//Параметры: СтрокаТаблицы Тип("СтрокаТабличнойЧасти")
//
//Возвращаемое значение: нет
//
Процедура ПересчитатьДанныеУпаковкиВСтроке(СтрокаТаблицы) Экспорт
		
	СтрокаТаблицы.КоличествоУпаковок = Окр(СтрокаТаблицы.Количество / ?(СтрокаТаблицы.Коэффициент > 0, СтрокаТаблицы.Коэффициент, 1), 3);
	СтрокаТаблицы.ЦенаЗаУпаковку = Окр(СтрокаТаблицы.Цена * ?(СтрокаТаблицы.Коэффициент > 0, СтрокаТаблицы.Коэффициент, 1), 2);
	
КонецПроцедуры

//Функция возвращает таблицу с данными упаковок по строкам таблицы товары
//Параметры: ТаблицаТоваров Тип("ТаблицаЗначений")
//
//Возвращаемыое значение: ДанныеУпаковок Тип("ТаблицаЗначений")
//
Функция ПолучитьДанныеУпаковок(ТаблицаТоваров)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Упаковка КАК Справочник.УпаковкиНоменклатуры) КАК Упаковка,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Количество КАК ЧИСЛО(15, 3)) КАК Количество,
	|	ВЫРАЗИТЬ(ТаблицаТоваров.Цена КАК ЧИСЛО(15, 2)) КАК Цена
	|ПОМЕСТИТЬ втТаблицаТоваров
	|ИЗ
	|	&ТаблицаТоваров КАК ТаблицаТоваров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втТаблицаТоваров.НомерСтроки КАК НомерСтроки,
	|	втТаблицаТоваров.Номенклатура КАК Номенклатура,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 1) КАК КоэффициентУпаковки,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Наименование, КлассификаторЕдиницИзмерения.Наименование) КАК УпаковкаЕдиницаИзмерения,
	|	ВЫРАЗИТЬ(втТаблицаТоваров.Количество / ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 1) КАК ЧИСЛО(15, 3)) КАК КоличествоУпаковок,
	|	ВЫРАЗИТЬ(втТаблицаТоваров.Цена * ЕСТЬNULL(УпаковкиНоменклатуры.Коэффициент, 1) КАК ЧИСЛО(15, 2)) КАК ЦенаЗаУпаковку,
	|	ЕСТЬNULL(УпаковкиНоменклатуры.Ссылка, КлассификаторЕдиницИзмерения.Ссылка) КАК Упаковка
	|ИЗ
	|	втТаблицаТоваров КАК втТаблицаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КлассификаторЕдиницИзмерения КАК КлассификаторЕдиницИзмерения
	|		ПО втТаблицаТоваров.Номенклатура.ЕдиницаИзмерения = КлассификаторЕдиницИзмерения.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|		ПО втТаблицаТоваров.Упаковка = УпаковкиНоменклатуры.Ссылка
	|			И (УпаковкиНоменклатуры.Коэффициент > 0)
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	
	ТаблицаУпаковок =  Запрос.Выполнить().Выгрузить();
	ТаблицаУпаковок.Индексы.Добавить("НомерСтроки");
	
	Возврат ТаблицаУпаковок;
	
КонецФункции

//Определяет есть ли упаковки в документе
//Параметры: ДокументСсылка Тип("ДокументСсылка.ПоступлениеТоваровУслуг") 
//							Тип("ДокументСсылка.РеализацияТоваровУслуг")
//
//Возвращаемое значение: ЕстьУпаковки Тип("Булево")
//
Функция ЕстьУпаковкиВДокументе(ДокументСсылка) Экспорт
	
	ЕстьУпаковки = Ложь;
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	Если Не ОбщегоНазначенияБП.ЕстьРеквизитТабЧастиДокумента("Упаковка", МетаданныеДокумента, "Товары") ТОгда
		Возврат ЕстьУпаковки;
	КонецЕсли;
	
	ИмяДокумента = МетаданныеДокумента.Имя;
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТоварыДокумента.Упаковка) КАК КоличествоУпаковок
	|ИЗ
	|	Документ.%1.Товары КАК ТоварыДокумента
	|ГДЕ
	|	ТоварыДокумента.Упаковка ССЫЛКА Справочник.УпаковкиНоменклатуры
	|	И НЕ ТоварыДокумента.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
	|	И ТоварыДокумента.Ссылка = &Ссылка";
	ТекстЗапроса = СтрШаблон(ТекстЗапроса, ИмяДокумента);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЕстьУпаковки = Выборка.КоличествоУпаковок > 0;
	КонецЕсли;
	
	Возврат ЕстьУпаковки;
	
КонецФункции 

//Получает упаковку по единица измерения первую попавшуюся, 
//если упаковок для такой единицы несколько с разным коэффициентом, 
//если упаковки нет вобще то возвращает единицу измерения номенклатуры 
//Параметры:
//			- Номенклатура Тип("СправочникСсылка.Номенклатура")
//			- ЕдиницаИзмерения Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//			  или Тип("Строка") -код единицы измерения
//
//Возвращаемое значение: Упаковка 
//						- Тип("СправочникСсылка.УпаковкиНоменклатуры") или 
//						- Тип("СправочникСсылка.КлассификаторЕдиницИзмерения")
//
Функция НайтиУпаковкуПоЕдиницеИзмерения(Номенклатура, ЕдиницаИзмерения) Экспорт
	
	Если ТипЗнч(ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ЕдиницаИзмерения");
		ЕдиницаПоКлассификатору = ЕдиницаИзмерения;
	Иначе
		Упаковка = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(ЕдиницаИзмерения);
		ЕдиницаПоКлассификатору = Упаковка;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УпаковкиНоменклатуры.Ссылка КАК Упаковка
	|ИЗ
	|	Справочник.УпаковкиНоменклатуры КАК УпаковкиНоменклатуры
	|ГДЕ
	|	УпаковкиНоменклатуры.Владелец = &Номенклатура
	|	И УпаковкиНоменклатуры.ЕдиницаИзмерения = &ЕдиницаИзмерения";
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения", ЕдиницаПоКлассификатору);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Упаковка = Выборка.Упаковка;
	КонецЕсли;
	
	Возврат Упаковка;
	
КонецФункции 

//Производит пересчет цена за упаковку при изменинении цены или суммы в табличной части
//Параметры: Форма Тип("ФормаКлиентскогоПриложения"
//
//Возвращаемое значение: нет
//
Процедура ПересчитатьЦеныЗаУпаковку(Форма) Экспорт
	
	Для Каждого СтрокаТовары Из Форма.Объект.Товары Цикл
		СтрокаТовары.ЦенаЗаУпаковку = ОКР(СтрокаТовары.Цена * СтрокаТовары.КоэффициентУпаковки, 2);
	КонецЦикла;
	
КонецПроцедуры

//Процедура Дополняет таблицу товаров колонками для упаковок при обмене данных
//Параметры: ТаблицаТоваров Тип("ТаблицаЗначений")
//
//Возвращаемое значение: Нет
//
Процедура ЗаполнитьДополнительныеПоляУпаковкиДляОбмена(ТаблицаТоваров) Экспорт
	
	Если ТаблицаТоваров.Колонки.Найти("Упаковка") = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТаблицаТоваров.Колонки.Найти("КоличествоУпаковок") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("КоличествоУпаковок", Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,3)), "Количество упаковок", 10);
	КонецЕсли;
	Если ТаблицаТоваров.Колонки.Найти("ЦенаЗаУпаковку") = Неопределено Тогда
		ТаблицаТоваров.Колонки.Добавить("ЦенаЗаУпаковку" , Новый ОписаниеТипов("Число", , , Новый КвалификаторыЧисла(15,2)), "Цена за упаковку", 10);
	КонецЕсли;
		
	Для Каждого СтрокаТаблицы Из ТаблицаТоваров Цикл 
		Коэффициент 						= УпаковкиВызовСервера.КоэффициентУпаковки(СтрокаТаблицы.Упаковка);
		СтрокаТаблицы.КоличествоУпаковок 	= ОКР(СтрокаТаблицы.Количество / Коэффициент, 3);
		СтрокаТаблицы.ЦенаЗаУпаковку 		= ОКР(СтрокаТаблицы.Цена * Коэффициент, 2);
	КонецЦикла;
	
КонецПроцедуры   

//Заполняет данные строки данными по упаковке по умолчанию при изменении номенклатуры
//Параметры: 
//			- Форма Тип("ФормаКлиентскогоПриложения")
//			- ДанныеСтроки Тип("Структура")
//
//Возвращаемое значение: нет
//
Процедура ДополнитьДанныеСтрокиПоУпаковке(Форма, ДанныеСтроки) Экспорт
	
	Если Не Форма.ИспользуютсяУпаковки Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ДанныеСтроки.Свойство("Упаковка") Тогда
		ДанныеСтроки.Вставить("Упаковка");
	КонецЕсли;
	Если Не ДанныеСтроки.Свойство("УпковкаЕдиницаИзмерения") Тогда
		ДанныеСтроки.Вставить("УпаковкаЕдиницаИзмерения");
	КонецЕсли;
	Если Не ДанныеСтроки.Свойство("КоличествоУпаковок") Тогда
		ДанныеСтроки.Вставить("КоличествоУпаковок");
	КонецЕсли;
	Если Не ДанныеСтроки.Свойство("ЦенаЗаУпаковку") Тогда
		ДанныеСтроки.Вставить("ЦенаЗаУпаковку");
	КонецЕсли;
	Если Не ДанныеСтроки.Свойство("КоэффициентУпаковки") Тогда
		ДанныеСтроки.Вставить("КоэффициентУпаковки");
	КонецЕсли;
	
	Если Не ДанныеСтроки.Свойство("ЕдиницаИзмерения") Тогда
		Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.Номенклатура, "ЕдиницаИзмерения");
	Иначе
		Упаковка = ДанныеСтроки.ЕдиницаИзмерения;
	КонецЕсли;
	
	ДанныеСтроки.Упаковка 					= Упаковка;
	ДанныеСтроки.КоэффициентУпаковки		= ?(ТипЗнч(Упаковка)= Тип("СправочникСсылка.УпаковкиНоменклатуры"), Упаковка.Коэффициент, 1);
	ДанныеСтроки.УпаковкаЕдиницаИзмерения 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСтроки.Упаковка, "Наименование");
	ДанныеСтроки.КоличествоУпаковок 		= ДанныеСтроки.Количество;
	ДанныеСтроки.ЦенаЗаУпаковку 			= ДанныеСтроки.Цена;
	
	Если ДанныеСтроки.Свойство("КоличествоДоИзменения") Тогда
		ДанныеСтроки.Вставить("КоличествоУпаковокДоИзменения", ДанныеСтроки.Количество);
	КонецЕсли;
	Если ДанныеСтроки.Свойство("КоличествоДоКорректировки") Тогда
		ДанныеСтроки.Вставить("КоличествоУпаковокДоКорректировки", ДанныеСтроки.Количество);
	КонецЕсли;
	Если ДанныеСтроки.Свойство("ЦенаДоИзменения") Тогда
		ДанныеСтроки.Вставить("ЦенаЗаУпаковкуДоИзменения", ДанныеСтроки.Цена);
	КонецЕсли;
	Если ДанныеСтроки.Свойство("ЦенаДоКорректировки") Тогда
		ДанныеСтроки.Вставить("ЦенаЗаУпаковкуДоКорректировки", ДанныеСтроки.Цена);
	КонецЕсли;
	
КонецПроцедуры
